<a href="https://colab.research.google.com/github/raghav5102/ML-prediction-models/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

TITANIC SURVIVAL OF PASSENGERS (KAGGLE DATASET)

In [ ]:
%load_ext autoreload
%autoreload 2

%matplotlib inline

In [ ]:


from fastai.imports import *


from sklearn.ensemble import RandomForestRegressor, RandomForestClassifier
from IPython.display import display

from sklearn import metrics

In [ ]:
df=pd.read_csv('train.csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
string_remove_list = ['Name','Ticket','Cabin','Embarked']

In [ ]:
dft=pd.read_csv('test.csv')
dft.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
df.drop(string_remove_list,axis=1,inplace=True)
dft.drop(string_remove_list,axis=1,inplace=True)
dft.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare
0          892       3    male  34.5      0      0   7.8292
1          893       3  female  47.0      1      0   7.0000
2          894       2    male  62.0      0      0   9.6875
3          895       3    male  27.0      0      0   8.6625
4          896       3  female  22.0      1      1  12.2875

In [ ]:
dft=dft.set_index('PassengerId')
df=df.set_index('PassengerId')
dft.head()

             Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
892               3    male  34.5      0      0   7.8292
893               3  female  47.0      1      0   7.0000
894               2    male  62.0      0      0   9.6875
895               3    male  27.0      0      0   8.6625
896               3  female  22.0      1      1  12.2875

In [ ]:
Sex={'male':1,'female':0}

In [ ]:
df.Sex= [Sex[item] for item in df.Sex]

In [ ]:
df.head()

             Survived  Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0       3    1  22.0      1      0   7.2500
2                   1       1    0  38.0      1      0  71.2833
3                   1       3    0  26.0      0      0   7.9250
4                   1       1    0  35.0      1      0  53.1000
5                   0       3    1  35.0      0      0   8.0500

In [ ]:
dft.Sex = [Sex[item] for item in dft.Sex]
dft.head()

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
892               3    1  34.5      0      0   7.8292
893               3    0  47.0      1      0   7.0000
894               2    1  62.0      0      0   9.6875
895               3    1  27.0      0      0   8.6625
896               3    0  22.0      1      1  12.2875

In [ ]:
df.fillna(method='pad', inplace=True)
df.fillna(method='pad', inplace=True)
dft.fillna(method='pad', inplace=True)
dft.fillna(method='pad', inplace=True)

In [ ]:
df.head()

             Survived  Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0       3    1  22.0      1      0   7.2500
2                   1       1    0  38.0      1      0  71.2833
3                   1       3    0  26.0      0      0   7.9250
4                   1       1    0  35.0      1      0  53.1000
5                   0       3    1  35.0      0      0   8.0500

In [ ]:
dft.head()

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
892               3    1  34.5      0      0   7.8292
893               3    0  47.0      1      0   7.0000
894               2    1  62.0      0      0   9.6875
895               3    1  27.0      0      0   8.6625
896               3    0  22.0      1      1  12.2875

In [ ]:
y_train=df.Survived

In [ ]:
X_train=df.drop('Survived',axis=1)

In [ ]:
X_train.head()

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
1                 3    1  22.0      1      0   7.2500
2                 1    0  38.0      1      0  71.2833
3                 3    0  26.0      0      0   7.9250
4                 1    0  35.0      1      0  53.1000
5                 3    1  35.0      0      0   8.0500

In [ ]:
X_test=dft

In [ ]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
scaler = MinMaxScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [ ]:
clf= RandomForestClassifier(n_jobs=-1,n_estimators=1000,max_features=0.5)
clf.fit(X_train_scaled, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features=0.5,
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=-1, oob_score=False, random_state=None, verbose=0,
                       warm_start=False)

In [ ]:
y_test=clf.predict(X_test_scaled)

In [ ]:
dft['Survived']=y_test

In [ ]:
dft.head()

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
892               3    1  34.5      0      0   7.8292         0
893               3    0  47.0      1      0   7.0000         1
894               2    1  62.0      0      0   9.6875         1
895               3    1  27.0      0      0   8.6625         1
896               3    0  22.0      1      1  12.2875         0

In [ ]:
answer=dft['Survived']
answer

PassengerId
892     0
893     1
894     1
895     1
896     0
       ..
1305    0
1306    1
1307    0
1308    0
1309    0
Name: Survived, Length: 418, dtype: int64

In [ ]:
solution=pd.DataFrame([answer]).transpose().reset_index()
solution

     PassengerId  Survived
0            892         0
1            893         1
2            894         1
3            895         1
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [ ]:
from google.colab import drive
drive.mount('drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
Â·Â·Â·Â·Â·Â·Â·Â·Â·Â·
Mounted at drive

In [ ]:
solution.to_csv('outcome.csv',index=False)
!cp outcome.csv "drive/My Drive/"